> switch
port_mask 0x1c
phy_base 0
wan_port 4

> network
mode router

> lan
proto static
ip 192.168.0.1
netmask 255.255.255.0
dhcp-server enable
dhcp-pool 192.168.0.10-192.168.0.254
ifname eth0

> wan
proto dhcp
ifname eth1
mtu 1500
nat enable

